---
kind: type
id: T:Autodesk.Revit.DB.Toposolid
source: html/7516b682-d489-a462-47ab-192c63d1d9e4.htm
---
# Autodesk.Revit.DB.Toposolid

An object that represents a Toposolid within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class Toposolid : CeilingAndFloor
```